BAS BMEKZU Project/src/Enums/ЗадачиНачалаРаботы/ЗадачиНачалаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗадачиНачалаРаботы</name>
  <enumValues>
    <name>ДоступКОрганизациям</name>
  </enumValues>
  <enumValues>
    <name>РеквизитыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПараметрыУчета</name>
  </enumValues>
  <enumValues>
    <name>УчетнаяПолитика</name>
  </enumValues>
  <enumValues>
    <name>НачальныеОстатки</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ЗадачиНачалаРаботы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Содержит перечень задач, без выполнения которых нельзя выполнять регулярные задачи.
// 
Функция НельзяИзбежать() Экспорт
	
	НельзяИзбежать = Новый Массив;
	НельзяИзбежать.Добавить(РеквизитыОрганизации);
 	НельзяИзбежать.Добавить(ДоступКОрганизациям);
	
	Возврат Новый ФиксированныйМассив(НельзяИзбежать);
	
КонецФункции

// Возвращает массив задач начала работы, которые нельзя пропустить
//
Функция ОбязательныеЗадачиНачалаРаботы() Экспорт
	
	ЗадачиНачалаРаботы = Новый Массив;
	
	Если Не ОбщегоНазначенияБПВызовСервера.ПроверитьНаличиеДоступныхОрганизаций() Тогда
		// У пользователя нет доступных организаций и нет прав на добавление таких организаций
		ЗадачиНачалаРаботы.Добавить(Перечисления.ЗадачиНачалаРаботы.ДоступКОрганизациям);
	ИначеЕсли Справочники.Организации.КоличествоОрганизаций() = 0 Тогда
		// Доступ к добавлению организаций есть. Возможно, следует добавить организацию.
		ЗадачиНачалаРаботы.Добавить(Перечисления.ЗадачиНачалаРаботы.РеквизитыОрганизации);
	КонецЕсли;
	
	Возврат ЗадачиНачалаРаботы;
	
КонецФункции

// Возвращает представление команды выполнения задачи
//
Функция ПредставлениеКомандыВыполнить(Задача) Экспорт
	
	Если Задача = Перечисления.ЗадачиНачалаРаботы.РеквизитыОрганизации Тогда
		
		Команда = НСтр("ru='Заполнить реквизиты';uk='Заповнити реквізити'");
		
	ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.ПараметрыУчета Тогда
		
		Команда = НСтр("ru='Открыть параметры';uk='Відкрити параметри'");
		
	ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.УчетнаяПолитика  Тогда
		
		Команда = НСтр("ru='Открыть настройки';uk='Відкрити настройки'");
		
	ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.НачальныеОстатки Тогда
		
		Команда = НСтр("ru='Открыть помощник';uk='Відкрити помічник'");
		
	Иначе
		
		Команда = НСтр("ru='Выполнить задачу';uk='Виконати задачу'");
		
	КонецЕсли;
	
	Возврат Команда;
	
КонецФункции

#КонецЕсли
